<a href="https://colab.research.google.com/github/OknamKim/codepress/blob/master/3_Pandas_%5BColab%5D(Quiz%ED%8F%AC%ED%95%A8).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## 3. Pandas

In [0]:
import pandas as pd

In [0]:
data = ['2016', '2017', '2018', '2019']
result = pd.Series(data)
result

0    2016
1    2017
2    2018
3    2019
dtype: object

In [0]:
result.index

RangeIndex(start=0, stop=4, step=1)

In [0]:
result.values

array(['2016', '2017', '2018', '2019'], dtype=object)

In [0]:
result.name = 'Year'
result

0    2016
1    2017
2    2018
3    2019
Name: Year, dtype: object

In [0]:
result.index.name = 'No'
result

No
0    2016
1    2017
2    2018
3    2019
Name: Year, dtype: object

In [0]:
data = ['2016', '2017', '2018', '2019']
result = pd.Series(data, index = ['a', 'b', 'c', 'd'])
result

a    2016
b    2017
c    2018
d    2019
dtype: object

In [0]:
result.index

Index(['a', 'b', 'c', 'd'], dtype='object')

### Quiz

In [0]:
data = ['apple', 'kiwi', 'orange', 'banana', 'melon']
fruit = pd.Series(data)
fruit

0     apple
1      kiwi
2    orange
3    banana
4     melon
dtype: object

In [0]:
fruit.index

RangeIndex(start=0, stop=5, step=1)

In [0]:
fruit.values

array(['apple', 'kiwi', 'orange', 'banana', 'melon'], dtype=object)

In [0]:
fruit.index.name = 'Num'
fruit

Num
0     apple
1      kiwi
2    orange
3    banana
4     melon
dtype: object

In [0]:
fruit.index = ['a', 'b', 'c', 'd', 'e']
fruit

a     apple
b      kiwi
c    orange
d    banana
e     melon
dtype: object

In [0]:
fruit2 = pd.Series(data, index = [1, 2, 3, 4, 5])
fruit2

1     apple
2      kiwi
3    orange
4    banana
5     melon
dtype: object

In [0]:
score = {'Kim':85, 'Hwang':100, 'Lee':99, 'Choi':80}
result = pd.Series(score)
result

Kim       85
Hwang    100
Lee       99
Choi      80
dtype: int64

In [0]:
result.index

Index(['Kim', 'Hwang', 'Lee', 'Choi'], dtype='object')

In [0]:
result.values

array([ 85, 100,  99,  80])

In [0]:
result['Lee'] = 100

In [0]:
result['Lee']

100

In [0]:
result['Hwang']

100

In [0]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}
df = pd.DataFrame(data)
df

    name  score grade
0    Lee    100     A
1  Hwang     95     A
2    Kim     90     B
3   Choi     85     B

In [0]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [0]:
df.values

array([['Lee', 100, 'A'],
       ['Hwang', 95, 'A'],
       ['Kim', 90, 'B'],
       ['Choi', 85, 'B']], dtype=object)

In [0]:
df.columns

Index(['name', 'score', 'grade'], dtype='object')

In [0]:
df.index.name = 'NO'
df.columns.name = 'Info'
df

Info   name  score grade
NO
0       Lee    100     A
1     Hwang     95     A
2       Kim     90     B
3      Choi     85     B

In [0]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}
c = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(data, columns=c)
df2

    name grade  score  etc
0    Lee     A    100  NaN
1  Hwang     A     95  NaN
2    Kim     B     90  NaN
3   Choi     B     85  NaN

In [0]:
score = {'Kim':85, 'Hwang':100, 'Lee':99, 'Choi':80}
students = ['Hwang', 'Lee', 'Woo']
result = pd.Series(score, index=students)
print(result)

Hwang    100.0
Lee       99.0
Woo        NaN
dtype: float64

### Quiz

In [0]:
dict = {'name': ['David', 'Roy', 'Tina', 'Kim'],
       'score': [78, 64, 70, 62],
       'grade': ['C', 'D', 'C', 'D']}
df = pd.DataFrame(dict)
df

    name  score grade
0  David     78     C
1    Roy     64     D
2   Tina     70     C
3    Kim     62     D

In [0]:
df.index.name = "No"
df.columns.name = 'Info'
df

Info   name  score grade
No
0     David     78     C
1       Roy     64     D
2      Tina     70     C
3       Kim     62     D

In [0]:
col = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(dict, columns = col)
df2

    name grade  score  etc
0  David     C     78  NaN
1    Roy     D     64  NaN
2   Tina     C     70  NaN
3    Kim     D     62  NaN

In [0]:
df.index

RangeIndex(start=0, stop=4, step=1, name='No')

In [0]:
df.columns

Index(['name', 'score', 'grade'], dtype='object', name='Info')

In [0]:
df.values

array([['David', 78, 'C'],
       ['Roy', 64, 'D'],
       ['Tina', 70, 'C'],
       ['Kim', 62, 'D']], dtype=object)

In [0]:
df.info

<bound method DataFrame.info of Info   name  score grade
No
0     David     78     C
1       Roy     64     D
2      Tina     70     C
3       Kim     62     D>

In [0]:
df.describe()

Info       score
count   4.000000
mean   68.500000
std     7.187953
min    62.000000
25%    63.500000
50%    67.000000
75%    72.000000
max    78.000000

In [0]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}
c = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(data, columns=c)
df2

    name grade  score  etc
0    Lee     A    100  NaN
1  Hwang     A     95  NaN
2    Kim     B     90  NaN
3   Choi     B     85  NaN

In [0]:
df2['name']

0      Lee
1    Hwang
2      Kim
3     Choi
Name: name, dtype: object

In [0]:
df2.name

0      Lee
1    Hwang
2      Kim
3     Choi
Name: name, dtype: object

In [0]:
df2[['name', 'grade']]

    name grade
0    Lee     A
1  Hwang     A
2    Kim     B
3   Choi     B

In [0]:
df2[['etc', 'name']]

   etc   name
0  NaN    Lee
1  NaN  Hwang
2  NaN    Kim
3  NaN   Choi

### Quiz

In [0]:
dict = {'name': ['David', 'Roy', 'Tina', 'Kim'],
       'score': [78, 64, 70, 62],
       'grade': ['C', 'D', 'C', 'D']}
col = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(dict, columns = col)
df2

    name grade  score  etc
0  David     C     78  NaN
1    Roy     D     64  NaN
2   Tina     C     70  NaN
3    Kim     D     62  NaN

In [0]:
df2['name']

0    David
1      Roy
2     Tina
3      Kim
Name: name, dtype: object

In [0]:
df[['name', 'grade', 'score']]

Info   name grade  score
No
0     David     C     78
1       Roy     D     64
2      Tina     C     70
3       Kim     D     62

In [0]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
             'score':[100, 95, 90, 85],
             'grade':['A', 'A', 'B', 'B']}
c = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(data, columns=c)
df2

In [0]:
df2['etc'] = [11, 22, 33, 44]
df2

    name grade  score  etc
0    Lee     A    100   11
1  Hwang     A     95   22
2    Kim     B     90   33
3   Choi     B     85   44

In [0]:
df2['etc'] = 0
df2

    name grade  score  etc
0    Lee     A    100    0
1  Hwang     A     95    0
2    Kim     B     90    0
3   Choi     B     85    0

In [0]:
import numpy as np
df2['etc'] = np.empty(4)
df2

    name grade  score            etc
0    Lee     A    100  5.089003e-317
1  Hwang     A     95  5.089003e-317
2    Kim     B     90  5.089003e-317
3   Choi     B     85  5.089003e-317

### Quiz

In [0]:
dict = {'name': ['David', 'Roy', 'Tina', 'Kim'],
       'score': [78, 64, 70, 62],
       'grade': ['C', 'D', 'C', 'D']}
col = ['name', 'grade', 'score', 'etc']
df2 = pd.DataFrame(dict, columns = col)
df2

    name grade  score  etc
0  David     C     78  NaN
1    Roy     D     64  NaN
2   Tina     C     70  NaN
3    Kim     D     62  NaN

In [0]:
df2['etc'] = [99, 88, 77, 66]
df2

    name grade  score  etc
0  David     C     78   99
1    Roy     D     64   88
2   Tina     C     70   77
3    Kim     D     62   66

In [0]:
df2['etc'] = np.ones(4, dtype=np.int)
df2

    name grade  score  etc
0  David     C     78    1
1    Roy     D     64    1
2   Tina     C     70    1
3    Kim     D     62    1

### 예제

In [0]:
data = {'name':['Lee', 'Hwang', 'Kim', 'Choi'],
     'score':[100, 95, 90, 85],
      'grade':['A', 'A', 'B', 'B']}
df2 = pd.DataFrame(data)
df2['etc'] = np.zeros(4)
df2

    name  score grade  etc
0    Lee    100     A  0.0
1  Hwang     95     A  0.0
2    Kim     90     B  0.0
3   Choi     85     B  0.0

In [0]:
points = pd.Series([1.5, 1.7, 2.4], index=[0, 1, 2])
points

0    1.5
1    1.7
2    2.4
dtype: float64

In [0]:
type(points)

pandas.core.series.Series

In [0]:
df2['points'] = points
df2

    name  score grade  etc  points
0    Lee    100     A  0.0     1.5
1  Hwang     95     A  0.0     1.7
2    Kim     90     B  0.0     2.4
3   Choi     85     B  0.0     NaN

In [0]:
df2['high_score'] = df2['score'] > 90
df2

    name  score grade  etc  points  high_score
0    Lee    100     A  0.0     1.5        True
1  Hwang     95     A  0.0     1.7        True
2    Kim     90     B  0.0     2.4       False
3   Choi     85     B  0.0     NaN       False

In [0]:
df2.loc[5, :] = ['Su', 'C', 7.0, 0.0, 1.1, False]
df2

    name score grade  etc  points  high_score
0    Lee   100     A  0.0     1.5        True
1  Hwang    95     A  0.0     1.7        True
2    Kim    90     B  0.0     2.4       False
3   Choi    85     B  0.0     NaN       False
5     Su     C     7  0.0     1.1       False

In [0]:
del df2['etc']
df2

    name score grade  points  high_score
0    Lee   100     A     1.5        True
1  Hwang    95     A     1.7        True
2    Kim    90     B     2.4       False
3   Choi    85     B     NaN       False
5     Su     C     7     1.1       False

In [0]:
df2.drop(5)

    name score grade  points  high_score
0    Lee   100     A     1.5        True
1  Hwang    95     A     1.7        True
2    Kim    90     B     2.4       False
3   Choi    85     B     NaN       False

In [0]:
df2

    name score grade  points  high_score
0    Lee   100     A     1.5        True
1  Hwang    95     A     1.7        True
2    Kim    90     B     2.4       False
3   Choi    85     B     NaN       False
5     Su     C     7     1.1       False

In [0]:
df2.set_index('name', inplace=True)
df2

      score grade  points  high_score
name
Lee     100     A     1.5        True
Hwang    95     A     1.7        True
Kim      90     B     2.4       False
Choi     85     B     NaN       False
Su        C     7     1.1       False

In [0]:
df2[1:3]

      score grade  points  high_score
name
Hwang    95     A     1.7        True
Kim      90     B     2.4       False

In [0]:
df2[:2]

      score grade  points  high_score
name
Lee     100     A     1.5        True
Hwang    95     A     1.7        True

In [0]:
df2.loc['Lee']

score          100
grade            A
points         1.5
high_score    True
Name: Lee, dtype: object

In [0]:
df2.iloc[0:3]

      score grade  points  high_score
name
Lee     100     A     1.5        True
Hwang    95     A     1.7        True
Kim      90     B     2.4       False

In [0]:
df2.loc[['Lee', 'Choi']]

     score grade  points  high_score
name
Lee    100     A     1.5        True
Choi    85     B     NaN       False

In [0]:
df2.loc[:'Kim']

      score grade  points  high_score
name
Lee     100     A     1.5        True
Hwang    95     A     1.7        True
Kim      90     B     2.4       False

In [0]:
df2.loc['Kim':'Choi', ['grade', 'high_score']]

     grade  high_score
name
Kim      B       False
Choi     B       False

In [0]:
df2.iloc[:, 1:3]

      grade  points
name
Lee       A     1.5
Hwang     A     1.7
Kim       B     2.4
Choi      B     NaN
Su        7     1.1

In [0]:
df2[df2['points'] > 1.5]

      score grade  points  high_score
name
Hwang    95     A     1.7        True
Kim      90     B     2.4       False

In [0]:
df2.loc[df2['points'] > 1.5, :]

      score grade  points  high_score
name
Hwang    95     A     1.7        True
Kim      90     B     2.4       False

In [0]:
df2[df2['grade'] == 'A']

      score grade  points  high_score
name
Lee     100     A     1.5        True
Hwang    95     A     1.7        True

In [0]:
df2.loc[df2['grade'] == 'A', :]

      score grade  points  high_score
name
Lee     100     A     1.5        True
Hwang    95     A     1.7        True

### 예제2

In [0]:
import numpy as np
import pandas as pd

In [0]:
df = pd.DataFrame(np.arange(18).reshape(6,3),
                 index = ['a', 'b', 'c', 'd', 'e', 'f'], 
                 columns = ['x', 'y', 'z'])

In [0]:
df['data1'] = pd.Series([1.7, 1.2, 2.4], index=['a', 'e', 'c'])
df

    x   y   z  data1
a   0   1   2    1.7
b   3   4   5    NaN
c   6   7   8    2.4
d   9  10  11    NaN
e  12  13  14    1.2
f  15  16  17    NaN

In [0]:
df['date'] = pd.date_range('20200110', periods=6)
df

    x   y   z  data1       date
a   0   1   2    1.7 2020-01-10
b   3   4   5    NaN 2020-01-11
c   6   7   8    2.4 2020-01-12
d   9  10  11    NaN 2020-01-13
e  12  13  14    1.2 2020-01-14
f  15  16  17    NaN 2020-01-15

### NaN 다루기

In [0]:
df.dropna(how='all')

    x   y   z  data1       date
a   0   1   2    1.7 2020-01-10
b   3   4   5    NaN 2020-01-11
c   6   7   8    2.4 2020-01-12
d   9  10  11    NaN 2020-01-13
e  12  13  14    1.2 2020-01-14
f  15  16  17    NaN 2020-01-15

In [0]:
df.dropna(how="any")

    x   y   z  data1       date
a   0   1   2    1.7 2020-01-10
c   6   7   8    2.4 2020-01-12
e  12  13  14    1.2 2020-01-14

In [0]:
df['data2'] = np.nan
df

    x   y   z  data1       date  data2
a   0   1   2    1.7 2020-01-10    NaN
b   3   4   5    NaN 2020-01-11    NaN
c   6   7   8    2.4 2020-01-12    NaN
d   9  10  11    NaN 2020-01-13    NaN
e  12  13  14    1.2 2020-01-14    NaN
f  15  16  17    NaN 2020-01-15    NaN

In [0]:
df.isnull()

       x      y      z  data1   date  data2
a  False  False  False  False  False   True
b  False  False  False   True  False   True
c  False  False  False  False  False   True
d  False  False  False   True  False   True
e  False  False  False  False  False   True
f  False  False  False   True  False   True

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 6 columns):
x        6 non-null int64
y        6 non-null int64
z        6 non-null int64
data1    3 non-null float64
date     6 non-null datetime64[ns]
data2    0 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(3)
memory usage: 496.0+ bytes

In [0]:
df['data2'] = df['data2'].astype('float')
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, a to f
Data columns (total 6 columns):
x        6 non-null int64
y        6 non-null int64
z        6 non-null int64
data1    3 non-null float64
date     6 non-null datetime64[ns]
data2    0 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(3)
memory usage: 496.0+ bytes

In [0]:
df.fillna(value='not null', inplace=True)
df

    x   y   z     data1       date     data2
a   0   1   2       1.7 2020-01-10  not null
b   3   4   5  not null 2020-01-11  not null
c   6   7   8       2.4 2020-01-12  not null
d   9  10  11  not null 2020-01-13  not null
e  12  13  14       1.2 2020-01-14  not null
f  15  16  17  not null 2020-01-15  not null

### 예제 3

In [0]:
df['data2'] = [55,np.nan, np.nan, 77, np.nan, 33]
df.index = ['f','a','y','i','b','e']
df

In [0]:
df.sort_index()

    x   y   z     data1       date  data2
a   3   4   5  not null 2020-01-11    NaN
b  12  13  14       1.2 2020-01-14    NaN
e  15  16  17  not null 2020-01-15   33.0
f   0   1   2       1.7 2020-01-10   55.0
i   9  10  11  not null 2020-01-13   77.0
y   6   7   8       2.4 2020-01-12    NaN

In [0]:
df.sort_index(ascending=False)

    x   y   z     data1       date  data2
y   6   7   8       2.4 2020-01-12    NaN
i   9  10  11  not null 2020-01-13   77.0
f   0   1   2       1.7 2020-01-10   55.0
e  15  16  17  not null 2020-01-15   33.0
b  12  13  14       1.2 2020-01-14    NaN
a   3   4   5  not null 2020-01-11    NaN

In [0]:
df.sort_index(axis=1)

      data1  data2       date   x   y   z
f       1.7   55.0 2020-01-10   0   1   2
a  not null    NaN 2020-01-11   3   4   5
y       2.4    NaN 2020-01-12   6   7   8
i  not null   77.0 2020-01-13   9  10  11
b       1.2    NaN 2020-01-14  12  13  14
e  not null   33.0 2020-01-15  15  16  17

In [0]:
df.sort_index(axis=1, ascending=False)

    z   y   x       date  data2     data1
f   2   1   0 2020-01-10   55.0       1.7
a   5   4   3 2020-01-11    NaN  not null
y   8   7   6 2020-01-12    NaN       2.4
i  11  10   9 2020-01-13   77.0  not null
b  14  13  12 2020-01-14    NaN       1.2
e  17  16  15 2020-01-15   33.0  not null

In [0]:
df.sort_values(by='data2', ascending=False)

    x   y   z     data1       date  data2
i   9  10  11  not null 2020-01-13   77.0
f   0   1   2       1.7 2020-01-10   55.0
e  15  16  17  not null 2020-01-15   33.0
a   3   4   5  not null 2020-01-11    NaN
y   6   7   8       2.4 2020-01-12    NaN
b  12  13  14       1.2 2020-01-14    NaN

### 웹크롤링 데이타 수집 후 데이타 분석

###
 사이트 주소 : http://kind.krx.co.kr/corpgeneral/corpList.do?method=loadInitPage

In [0]:
import pandas as pd

# KRX에서 상장사 정보 조회
df = pd.read_html('http://kind.krx.co.kr/corpgeneral/corpList.do?method=download&searchType=13')[0]
df.head()

     회사명    종목코드  ...                         홈페이지     지역
0    DSR  155660  ...           http://www.dsr.com  부산광역시
1  GS글로벌    1250  ...       http://www.gsgcorp.com  서울특별시
2  HSD엔진   82740  ...  http://www.doosanengine.com   경상남도
3  LG이노텍   11070  ...   http://www.lginnotek.co.kr  서울특별시
4    OCI   10060  ...         http://www.oci.co.kr  서울특별시

[5 rows x 9 columns]

In [0]:
import pandas as pd

# KRX에서 상장사 정보 조회
code_df = pd.read_html('http://kind.krx.co.kr/corpgeneral/corpList.do?method=download&searchType=13', header=0)[0]

code_df.종목코드 = code_df.종목코드.map('{:06d}'.format)
code_df = code_df[['회사명', '종목코드']]

code_df = code_df.rename(columns={'회사명' : 'name', '종목코드' : 'code'})

# 상장사코드 정보를 이용해 naver 주가 정보 화면 접속을 위한 url 생성 함수
def get_url(item_name, code_df):
  code = code_df.query("name=='{}'".format(item_name))['code'].values[0]
  url = 'https://finance.naver.com/item/sise_day.nhn?code={code}'.format(code=code)
  
  print("request URL = {}".format(url))
  return url

In [0]:
code_df.shape

(2354, 2)

In [0]:
code_df.head()

    name    code
0    DSR  155660
1  GS글로벌  001250
2  HSD엔진  082740
3  LG이노텍  011070
4    OCI  010060

In [0]:
item_name='삼성전자'
url = get_url(item_name, code_df)

df = pd.DataFrame()

import requests
from bs4 import BeautifulSoup

priceList = []

for page in range(1, 21):
  # 페이징 처리 되어 있는 주가정보의 url 생성
  pg_url = '{url}&page={page}'.format(url=url, page=page)
  
  # 해당 페이지의 html 정보 받아아 soup 객체 생성
  response= requests.get(pg_url)
  soup = BeautifulSoup(response.content, 'lxml')

request URL = https://finance.naver.com/item/sise_day.nhn?code=005930

In [0]:
item_name='삼성전자'
url = get_url(item_name, code_df)

df = pd.DataFrame()

import requests
from bs4 import BeautifulSoup

priceList = []

for page in range(1, 21):
    # 페이징 처리 되어 있는 주가정보의 url 생성
    pg_url = '{url}&page={page}'.format(url=url, page=page)
  
    # 해당 페이지의 html 정보 받아아 soup 객체 생성
    response= requests.get(pg_url)
    soup = BeautifulSoup(response.content, 'lxml')

    # 주가 데이터가 담겨있는 tr 태그 객체 조회
    trList = soup.body.find_all(name='tr', attrs={'onmouseover':'mouseOver(this)'})
  
    # td.tag 객체의 string 값 추출
    for row in trList:
        priceList.append([td.span.string.strip() for td in row.find_all(name='td')])

# 데이터 분석을 위해 Dataframe 객체로 변환
df = pd.DataFrame(priceList, columns=['date', 'close', 'diff', 'open', 'high', 'low', 'volume'])
df = df.dropna()

# 날짜 정보 데이터 타입 변환
df['date'] = pd.to_datetime(df['date'])
df = df.sort_values(by=['date'], ascending=True)

request URL = https://finance.naver.com/item/sise_day.nhn?code=005930

In [0]:
df.head()

          date   close   diff    open    high     low      volume
199 2019-03-22  46,550    700  46,850  47,000  46,250  12,535,911
198 2019-03-25  45,500  1,050  45,300  45,650  44,800   8,699,728
197 2019-03-26  45,250    250  45,500  45,700  44,900   9,729,811
196 2019-03-27  45,350    100  44,750  45,600  44,250   9,568,081
195 2019-03-28  44,850    500  44,950  45,200  44,300   6,821,306

In [0]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 199 to 0
Data columns (total 7 columns):
date      200 non-null datetime64[ns]
close     200 non-null object
diff      200 non-null object
open      200 non-null object
high      200 non-null object
low       200 non-null object
volume    200 non-null object
dtypes: datetime64[ns](1), object(6)
memory usage: 12.5+ KB

In [0]:
import locale
from locale import atof

locale.setlocale(locale.LC_NUMERIC,'')

# close(종가) 데이터 타입 변환 
df['close'] = df.close.str.replace(',', '').astype('float')


# 주가데이터 타입 변환 
# df[['close', 'diff', 'open', 'high', 'low', 'volume']] = df[['close', 'diff', 'open', 'high', 'low', 'volume']].applymap(float)

import plotly.graph_objects as go

# 데이터를 이용해 차트를 그리기 위한 Scatter 객체 생성
trace = go.Scatter(x = df.date, y=df.close, name=item_name)
data = [trace]

In [0]:
df.dtypes

date      datetime64[ns]
close            float64
diff              object
open              object
high              object
low               object
volume            object
dtype: object

In [0]:
# 차트를 그리기 위한 축 정보 설정
# layout = dict(
#     title='{} close Time Series'.format(item_name),
#     xaxis = dict(
#         rangeslider=dict(),
#         type='date'
#         )
# )

# 차트 객체 생성 및 렌더링
fig = go.Figure(data=data)
# fig = go.Figure(data=data, layout=layout)
fig.show()

import pandas_profiling

# 판다스 프로파일링 라이브러리를 이용한 분석
profile = pandas_profiling.ProfileReport(df)

/usr/local/lib/python3.6/dist-packages/pandas/plotting/_matplotlib/converter.py:103: FutureWarning:

Using an implicitly registered datetime converter for a matplotlib plotting method. The converter was registered by pandas on import. Future versions of pandas will require you to explicitly register matplotlib converters.

To register the converters:
	>>> from pandas.plotting import register_matplotlib_converters
	>>> register_matplotlib_converters()

/usr/local/lib/python3.6/dist-packages/pandas_profiling/describe.py:392: FutureWarning:

The join_axes-keyword is deprecated. Use .reindex or .reindex_like on the result to achieve the same functionality.

In [0]:
profile